In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [2]:
ser1 = Series([0,1,2],index = ['A','B','C'])
ser1

A    0
B    1
C    2
dtype: int64

In [3]:
ser2=  Series([3,4,5,6],index=['A','B','C','D'])
ser2

A    3
B    4
C    5
D    6
dtype: int64

In [4]:
ser1+ser2

A     3
B     5
C     7
D   NaN
dtype: float64

In [8]:
dframe1 = DataFrame(np.arange(4).reshape(2,2),index =['LA','NY'],columns=list('AB'))
dframe1

    A  B
LA  0  1
NY  2  3

In [10]:
dframe2 = DataFrame(np.arange(9).reshape(3,3),index =['LA','NY','SF'],columns=list('ABC'))
dframe2

    A  B  C
LA  0  1  2
NY  3  4  5
SF  6  7  8

In [12]:
dframe1+dframe2 # only adds where row and column matches

     A   B   C
LA   0   2 NaN
NY   5   7 NaN
SF NaN NaN NaN

In [13]:
dframe1.add(dframe2,fill_value=0)

    A  B  C
LA  0  2  2
NY  5  7  5
SF  6  7  8

In [18]:
#operation between Series and DataFrame
ser3 = dframe2.ix[0]
ser3

A    0
B    1
C    2
Name: LA, dtype: int64

In [19]:
dframe2-ser3

    A  B  C
LA  0  0  0
NY  3  3  3
SF  6  6  6